是的，我知道“Everything”软件。它是一款非常受欢迎的Windows电脑文件搜索工具，能够快速而准确地搜索计算机上的文件和文件夹。Everything以其快速的搜索速度和简单易用的界面而闻名，用户可以通过输入关键词来查找文件，搜索结果几乎是实时的。这款软件在管理大量文件的计算机用户中很受欢迎，因为它可以大大提高文件搜索的效率。

“Everything”是一款Windows电脑上的免费软件，其主要功能是快速而准确地搜索计算机上的文件和文件夹。它的工作原理非常简单：一旦安装并运行，“Everything”会在计算机上创建一个文件索引数据库，该数据库包含了计算机中所有文件和文件夹的信息。这意味着当你需要查找文件时，你可以通过输入关键词来搜索，而不必等待漫长的搜索过程。搜索结果几乎是实时的，让你能够迅速找到你需要的文件。

这款软件的优势之一是其极速的搜索速度。即使你的计算机上有成千上万个文件，它也能在几乎立即的时间内呈现搜索结果。这对于那些需要频繁搜索文件的人来说，无疑是一个巨大的时间节省。

另一个“Everything”的亮点是其简单易用的界面。软件界面清晰明了，只需在搜索框中输入关键词，它就会立即显示匹配的文件和文件夹。你甚至可以通过设置筛选条件来缩小搜索范围，以更快地找到所需的内容。



PotPlayer 提供了丰富的功能和选项，包括支持几乎所有常见的多媒体格式、强大的视频处理能力、高度可定制的界面、多种播放列表功能以及丰富的快捷键控制等。由于其稳定性和功能性，PotPlayer 在用户中享有很高的声誉，是许多人喜欢的首选播放器之一。



通过发送键盘或鼠标的键击动作命令来实现几乎所有操作的自动化。您可以自己编写 宏（AutoHotkey Script） 或者使用宏录制器（AutoScriptWriter）来生成；
为键盘，游戏操纵杆和鼠标创建 热键。 windows下任何的按键、按钮或组合键都可以被设置为热键；

https://zhuanlan.zhihu.com/p/666893350






sudo ln -s /software/python3.12/bin/pip3.12 /bin/pip



export HTTP_PROXY=10.97.48.102:7890
export HTTPS_PROXY=10.97.48.102:7890
